app/views/rating/show_conferences_rating.html.erb

    <%  @excelent_percent = @excelent_number *  100.0 / @total %>
    <% @conference = Conference.find_by_id(c_id) %>
---
SELECT `conferences`.* FROM `conferences` WHERE `conferences`.`id` = 4 LIMIT 1