app/views/rating/show_workshops_rating.html.erb

    <%  @stars_number = ((@bad_number + @can_improve_number * 2 + @good_number * 3 + @excelent_number * 4) / @total).round %>
    <% @workshop = Workshop.find_by_id(w_id) %>
---
SELECT `workshops`.* FROM `workshops` WHERE `workshops`.`id` = 7 LIMIT 1