app/views/attendees/_form.html.erb

      <%= f.label :subgroup_id, t("atten.atten.subgroup") %>
      <%= f.collection_select :subgroup_id, Subgroup.where(:event_id => session[:current_event_id]).order(:name), :id, :name %><span class="required">*</span>
---
SELECT `subgroups`.* FROM `subgroups` WHERE `subgroups`.`event_id` = 2 ORDER BY name