app/views/attendees/generate_gafete.html.erb

SELECT `conferences`.* FROM `conferences` ORDER BY start_date LIMIT 5
---
    <% @offset += 5 %>
    <% @conferences = Conference.limit(5).offset(@offset) %>

SELECT `diaries`.* FROM `diaries` ORDER BY event_date LIMIT 5
---
    <% @offset += 5 %>
    <% @diaries = Diary.limit(5).offset(@offset) %>