app/views/attendees/print_gafete_a.html.erb

SELECT `system_configurations`.* FROM `system_configurations` LIMIT 1
---
    <div id="gafete-container" style="height: 415px; margin: 0px; min-height: 400px; color: #000;">
      <% @system_configuration = SystemConfiguration.first %>