app/views/attendees/register.html.erb

SELECT `events`.* FROM `events`
SELECT `system_configurations`.* FROM `system_configurations` LIMIT 1
---
  <p class="field">
    <%= f.label :event_id, t("system_configuration.select_event").upcase %>

SELECT `subgroups`.* FROM `subgroups` ORDER BY name
---
      <%= f.label :subgroup_id, t("atten.atten.subgroup") %>
      <%= f.collection_select :subgroup_id, Subgroup.order(:name), :id ,:name %><span class="required">*</span>