app/views/events/_form.html.erb

      <p class="field">
        <%= user_form.label t'user.first_name' %>
---
SELECT `users`.* FROM `users` WHERE `users`.`event_id` = 1 LIMIT 1