app/controllers/attendees_controller.rb

SELECT COUNT(*) FROM `attendees` WHERE `attendees`.`event_id` = 2
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`event_id` = 2 ORDER BY id DESC LIMIT 1 OFFSET 0
---
  def index
    if params[:search].blank?
      @attendees = Attendee.where(:event_id => session[:current_event_id]).order('id DESC').paginate(:per_page => 10, :page => params[:page])

SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 0 LIMIT 1
---
  def show
    @attendee = Attendee.find(params[:id])

SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 1 LIMIT 1
---
  def edit
    @attendee = Attendee.find(params[:id])

SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 1 LIMIT 1
UPDATE `attendees` SET `a_platform` = 'Blackberry', `a_sector` = 2, `a_market_segment` = 'Gobierno;PyMEs;Web', `updated_at` = '2014-01-29 23:03:32' WHERE `attendees`.`id` = 1
---
  def update
    @attendee = Attendee.find(params[:id])
    params[:attendee][:a_platform] = (params[:attendee][:a_platform] & ["Blackberry", "IPhone", "Android"]) if params[:other_platform].nil?
    params[:attendee][:a_platform] = params[:attendee][:a_platform].join(";") unless params[:attendee][:a_platform].nil?
    params[:attendee][:a_market_segment] = (params[:attendee][:a_market_segment] & ["Gobierno", "Corporativo", "PyMEs", "Educación", "Salud", "Retail", "Web"]) if params[:other_market].nil?
    params[:attendee][:a_market_segment] = params[:attendee][:a_market_segment].join(";") unless params[:attendee][:a_market_segment].nil?

    respond_to do |format|
      if @attendee.update_attributes(params[:attendee])

SELECT DISTINCT `attendees`.`a_name` FROM `attendees` WHERE `attendees`.`event_id` = 2
---
  def get_all_attendee_names
    @attendees = Attendee.where(:event_id => session[:current_event_id]).uniq.pluck(:a_name)

SELECT `conferences`.* FROM `conferences` ORDER BY start_date LIMIT 5
SELECT `diaries`.* FROM `diaries` ORDER BY event_date LIMIT 5
SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def generate_gafete
    @attendee_id = params[:attendee_id]
    @a_name = params[:a_name]
    @conferences = Conference.order(:start_date).limit(5)
    @diaries = Diary.order(:event_date).limit(5)
    @e_tradename = params[:e_tradename]
    @e_phone = params[:e_phone]
    @a_email = params[:a_email]
    @e_address = params[:e_address]
    @a_web = params[:a_web]
    @is_exhibitor = params[:is_exhibitor] == "true"
    @event = Event.find_by_id(session[:current_event_id])

SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def print_gafete_a
    @a_name = params[:a_name]
    @e_tradename = params[:e_tradename]
    @e_phone = params[:e_phone]
    @a_email = params[:a_email]
    @e_address = params[:e_address]
    @a_web = params[:a_web]
    @with_logos = params[:with_logos]
    @with_qr_code = params[:with_qr_code]
    @is_exhibitor = params[:is_exhibitor] == "true"
    @event = Event.find_by_id(session[:current_event_id])

SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`event_id` = 2 AND `attendees`.`attendee_id` = 'Q444' LIMIT 1
SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
SELECT `events`.* FROM `events`
INSERT INTO `attendees` (`a_cellphone`, `a_chat`, `a_email`, `a_is_director`, `a_job`, `a_market_segment`, `a_name`, `a_num_employees`, `a_other_line`, `a_platform`, `a_radio_nextel`, `a_sec_line`, `a_sector`, `a_tel_nextel`, `a_want_email`, `a_web`, `attendee_id`, `confirmation_token`, `confirmed`, `created_at`, `e_city`, `e_colony`, `e_ext_number`, `e_int_number`, `e_lada`, `e_main_line`, `e_municipality`, `e_name`, `e_phone`, `e_rfc`, `e_state`, `e_street`, `e_tradename`, `e_zip_code`, `event_id`, `subgroup_id`, `updated_at`) VALUES ('', '', 'qwe@gmail.com', 0, 'qwe', '', 'qwe', NULL, '', '', '', '', 1, '', 0, '', 'EP9504', 'n482xswu9a', 0, '2014-01-30 01:17:05', 'qwe', 'qwe', 123, '', 123, '', 'qwe', 'qwe', '123', '', 'BAJA CALIFORNIA NORTE', 'qwe', '', 12323, 1, 1, '2014-01-30 01:17:05')
---
  def register_attendee
    if params[:attendee][:event_id].nil?
      respond_to do |format|
        format.html { render action: "register", layout: "registration_form" }
        format.json { render json: @attendee.errors, status: :unprocessable_entity }
      end
    else
      @event = Event.find_by_id(params[:attendee][:event_id])
      params[:attendee][:attendee_id] = @event.token_for_id.upcase + Array.new(4){[*'0'..'9'].sample}.join
      while !@event.attendees.find_by_attendee_id(params[:attendee][:attendee_id]).nil?
        params[:attendee][:attendee_id] = @event.token_for_id.upcase + Array.new(4){[*'0'..'9'].sample}.join
      end
      params[:attendee][:a_platform] = params[:attendee][:a_platform].join(";") unless params[:attendee][:a_platform].nil?
      params[:attendee][:a_market_segment] = params[:attendee][:a_market_segment].join(";") unless params[:attendee][:a_market_segment].nil?
      @attendee = Attendee.new(params[:attendee])
      @attendee.confirmation_token = Array.new(10) {[*'0'..'9', *'a'..'z'].sample}.join

      respond_to do |format|
        if @attendee.save

SELECT id, name FROM `subgroups` WHERE `subgroups`.`event_id` = 2
---
  def get_subgroups
    @subgroups = Subgroup.where(:event_id => params[:event_id]).select([:id, :name])

SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` IS NULL LIMIT 1
---
  def confirm
    @attendee = Attendee.find_by_id(params[:id])

SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
---
  def load_event
    @event = Event.find_by_id(session[:current_event_id])