app/controllers/events_controller.rb

  def index
    @events = Event.order('id DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT COUNT(*) FROM `events`
SELECT `events`.* FROM `events` ORDER BY id DESC LIMIT 1 OFFSET 0

  def show
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1

  def edit
    @event = Event.find(params[:id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1
UPDATE `events` SET `e_work_street` = '', `e_work_street_number` = '', `e_work_colony` = '', `e_work_zip` = '', `e_city` = '', `e_state` = '', `e_country` = '', `has_activity` = 1, `has_conference` = 1, `has_facetoface` = 1, `has_offert` = 1, `has_workshop` = 1, `start_date` = '2013-12-10 01:28:00', `end_date` = '2014-12-10 01:28:00', `updated_at` = '2014-01-28 22:41:36' WHERE `events`.`id` = 2