app/controllers/exhibitors_controller.rb

  def index
    if params[:with_offerts] == "1"
      @exhibitors = Exhibitor.joins("RIGHT OUTER JOIN offerts o ON exhibitors.id = o.exhibitor_id").where(:event_id => session[:current_event_id]).uniq
      @exhibitors.each {|e| e[:mobile_logo_url] = e.logo.url(:mobile)}
    elsif !params[:search].blank?
      @exhibitors = Exhibitor.where("event_id = #{session[:current_event_id]} AND contact LIKE '%#{params[:search]}%'").order('id DESC').paginate(:per_page => 10, :page => params[:page])
---
SELECT `exhibitors`.* FROM `exhibitors` WHERE `exhibitors`.`event_id` = 2 ORDER BY id DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `exhibitors` WHERE `exhibitors`.`event_id` = 2