app/controllers/mobile_services_controller.rb

  def get_attendee_id
    I18n.locale = params[:language]
    session[:language] = params[:language]
    @attendee_id = params[:attendee_id]

    if @attendee_id =~ /\A[A-Z]{2}\d{4}\z/
      token_for_id = @attendee_id[0, 2]
      @event = Event.find_by_token_for_id(token_for_id)
      @attendee = @event.attendees.find_by_attendee_id(@attendee_id)

      if !@attendee.nil?
        @nip = @attendee.nip

        while @nip.nil?
          random_value = Array.new(4) {[*'0'..'9', *'a'..'z'].sample}.join
          @exists = @event.nips.find_by_nip(random_value)

          if @exists.nil?
            @nip = Nip.create(:nip => random_value, :attendee_id => @attendee.id, :event_id => @event.id)
---
SELECT `events`.* FROM `events` WHERE `events`.`token_for_id` = 'AN' LIMIT 1
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`event_id` = 2 AND `attendees`.`attendee_id` = 'AN0001' LIMIT 1
SELECT `nips`.* FROM `nips` WHERE `nips`.`event_id` = 2 AND `nips`.`nip` = 'ad3c' LIMIT 1
INSERT INTO `nips` (`attendee_id`, `created_at`, `event_id`, `nip`, `sent`, `times_sent`, `updated_at`) VALUES (1, '2014-01-15 20:48:00', 2, 'ad3c', NULL, NULL, '2014-01-15 20:48:00')

            @name = @attendee.a_name
            @email = @attendee.a_email
            @subgroup_name = @attendee.subgroup.name
            @group_name = @attendee.subgroup.group.name
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT `subgroups`.* FROM `subgroups` WHERE `subgroups`.`id` = 3 LIMIT 1

            if !@attendee.a_email.nil?

              if AttendeeMailer.send_nip(@attendee, @nip).deliver!
                @nip.update_attributes(:sent => Time.now, :times_sent => (@nip.times_sent.nil?) ? 1: @nip.times_sent += 1 )
---
UPDATE `nips` SET `sent` = '2014-01-15 20:48:05', `times_sent` = 1, `updated_at` = '2014-01-15 20:48:05' WHERE `nips`.`id` = 2

  def get_attendee_nip
    @attendee_id = params[:attendee_id].split("-")[0]

    if @attendee_id =~ /\A[A-Z]{2}\d{4}\z/
      token_for_id = @attendee_id[0, 2]
      @event = Event.find_by_token_for_id(token_for_id)
      @attendee = @event.attendees.find_by_attendee_id(@attendee_id)
---
SELECT `events`.* FROM `events` WHERE `events`.`token_for_id` = 'AN' LIMIT 1
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`event_id` = 2 AND `attendees`.`attendee_id` = 'AN0001' LIMIT 1

  def index_sponsors

    if !session[:attendee_id].blank?
      @sponsors = @event.sponsors.order(:social_reason)
---
SELECT `sponsors`.* FROM `sponsors` WHERE `sponsors`.`event_id` = 1 ORDER BY social_reason

  def index_expositions

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      unless @attendee.nil?
        @expositions = @event.expositions.order("start_date DESC").select {|e| e.start_date.strftime('%d/%m/%Y') == params[:day]}
---
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 1 LIMIT 1
SELECT `expositions`.* FROM `expositions` WHERE `expositions`.`event_id` = 2 ORDER BY start_date DESC

  def rate_workshop

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      if params[:value] =~ /\A[1-4]\z/
        RateWorkshop.create(workshop_id: params[:workshop_id], attendee_id: @attendee.id, value: params[:value])
---
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 1 LIMIT 1
INSERT INTO `rate_workshops` (`attendee_id`, `created_at`, `event_id`, `updated_at`, `value`, `workshop_id`) VALUES (1, '2014-01-29 18:33:08', NULL, '2014-01-29 18:33:08', 4, 14)

  def rate_conference

    if !session[:attendee_id].blank?
      @attendee = Attendee.find_by_id(session[:attendee_id])

      if params[:value] =~ /\A[1-4]\z/
        RateConference.create(conference_id: params[:conference_id], attendee_id: @attendee.id, value: params[:value])
---
SELECT `attendees`.* FROM `attendees` WHERE `attendees`.`id` = 1 LIMIT 1
INSERT INTO `rate_conferences` (`attendee_id`, `conference_id`, `created_at`, `event_id`, `updated_at`, `value`) VALUES (1, 7, '2014-01-29 18:47:30', 2, '2014-01-29 18:47:30', 4)

  def load_event
    @event = Event.find_by_id(session[:current_event_id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` IS NULL LIMIT 1