app/controllers/mobile_services_controller.rb

  def rate_workshop

    if !session[:attendee_id].blank?
      @workshop = Workshop.find_by_id(params[:workshop_id])

      if params[:value] =~ /\A[1-4]\z/ && !@workshop.nil? && @event.has_workshop
        @rate_workshop = RateWorkshop.find_by_workshop_id_and_attendee_id(params[:workshop_id], session[:attendee_id])
---
SELECT `rate_workshops`.* FROM `rate_workshops` WHERE `rate_workshops`.`workshop_id` = 14 AND `rate_workshops`.`attendee_id` = 1 LIMIT 1

  def rate_conference

    if !session[:attendee_id].blank?
      @conference = Conference.find_by_id(params[:conference_id])

      if params[:value] =~ /\A[1-4]\z/ && !@conference.nil? && @event.has_conference
        @rate_conference = RateConference.find_by_conference_id_and_attendee_id(params[:conference_id], session[:attendee_id])
---
SELECT `rate_conferences`.* FROM `rate_conferences` WHERE `rate_conferences`.`conference_id` = 4 AND `rate_conferences`.`attendee_id` = 1 LIMIT 1