app/controllers/rating_controller.rb

  def show_application_rating
    @ratings = Rating.all
    @total = Rating.count
    @poor_number = Rating.where(:value => 1).count
---
SELECT `ratings`.* FROM `ratings`
SELECT COUNT(*) FROM `ratings`
SELECT COUNT(*) FROM `ratings` WHERE `ratings`.`value` = 1

  def show_workshops_rating
    if @event.has_workshop
      @ratings = RateWorkshop.where(:event_id => session[:current_event_id])
---
SELECT `rate_workshops`.* FROM `rate_workshops` WHERE `rate_workshops`.`event_id` IS NULL

  def show_conferences_rating
    if @event.has_conference
      @ratings = RateConference.where(:event_id => session[:current_event_id])
---
SELECT `rate_conferences`.* FROM `rate_conferences` WHERE `rate_conferences`.`event_id` = 2

  def load_event
    @event = Event.find_by_id(session[:current_event_id])
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 2 LIMIT 1