app/controllers/rating_controller.rb

SELECT `rate_workshops`.* FROM `rate_workshops`
SELECT COUNT(*) FROM `rate_workshops`
SELECT COUNT(*) FROM `rate_workshops` WHERE `rate_workshops`.`value` = 1
---
  def show_workshops_rating
    @ratings = RateWorkshop.all
    @total = RateWorkshop.count
    @poor_number = RateWorkshop.where(:value => 1).count