app/controllers/system_configurations_controller.rb

  def show
    @system_configuration = SystemConfiguration.find(params[:id])
---
SELECT `system_configurations`.* FROM `system_configurations` WHERE `system_configurations`.`id` = 1 LIMIT 1

  def edit
    @system_configuration = SystemConfiguration.find(params[:id])
---
SELECT `system_configurations`.* FROM `system_configurations` WHERE `system_configurations`.`id` = 1 LIMIT 1

  def update
    @system_configuration = SystemConfiguration.find(params[:id])

    respond_to do |format|
      if @system_configuration.update_attributes(params[:system_configuration])
---
SELECT `system_configurations`.* FROM `system_configurations` WHERE `system_configurations`.`id` = 1 LIMIT 1
UPDATE `system_configurations` SET `language` = 'en', `updated_at` = '2014-01-15 21:16:15' WHERE `system_configurations`.`id` = 1