app/views/layouts/_sidebar.erb

        <li>
          <%= link_to t(:configuration).mb_chars.upcase, edit_system_configuration_path(SystemConfiguration.first), :class=> "nav-top-item no-submenu" + (controller_name == "system_configurations" ? " current": ""), :id => "2main" %>
---
SELECT `system_configurations`.* FROM `system_configurations` LIMIT 1